package module_2.homeWork6;

public class Questions {
    //Какой родительский класс у всех классов? - Object
    //Как мне вызвать конструктор родительского класса? - через ключевое слово super
    //Будет ли автоматически вызываться конструктор родительского класса? - разве что по умолчанию который
    //Будет ли автоматически вызываться конструктор родительского класса с аргументами? - нет
    //Можно ли использовать тип интерфейса для полиморфизма? - Конечно

    //Ответы по кратинкам : 1)Нельзя; 2)Можно; 3)Можно; 4)Можно
}
