package module_2.homeWork3.questions;

public class Questions {

    // Можно ли создать экземпляр абстрактного класса? - Нет
    //Можно ли определить конструктор для абстрактного класса? - Да
   // Может ли в абстрактном классе быть неабстрактный метод? - Да
    //Могут ли в абстрактном классе быть абстрактные и не абстрактные методы? - Да
    //Может ли быть абстрактный метод в не абстрактном классе? -Нет
    //Можно ли переопределить неабстрактный метод? - Да
    //Все ли методы интерфейса абстрактны? - c 8 Java не все, есть default методы(можно создать)
    //Можно ли создать интерфейс без метода? - Да, только зачем?)

    //В чем разница между абстрактным классом и интерфейсом? -
    // 1) В названии (abstract, interface);
    // 2) Все поля в интерфейсе CONST(public static final)
    // 3) В интерфейсе можно создать default method
    // 4) Класс может наследовать только один класс, но реализовывать сколько угодно интерфейсаов
}
